{
  "mainAboutMe" :
        "Clovis born, Pewaukee raised, and Renton living, I am a University of Washington - Bothell graduate with a BA of Science - Computer Science & Software Engineering. I enjoy creating software and working on various projects to expand my knowledge and skill set. Over the last few years, I worked on projects involving graphics, game engines, and web applications.",
  "mainProjects" :
        "I program in many various languages such as Python, C++, C#, Java, JavaScript, and more. Some of my previous projects include a JavaScript web based game engine, a modified version that includes a physics engine module, a Voxel based game engine, and more.",
  "projData": [
    {
      "title": "Patina Network",
      "desc": "Working on curated projects to explore roles within the tech field, grow/enhance my skills, and make a meaningful impact to the startup.",
      "img": [
        "https://picsum.photos/400/300/?blur=5",
        "https://picsum.photos/400/300/?blur=5",
        "https://picsum.photos/400/300/?blur=5"
      ]
    },
    {
      "title": "Voxel Game Engine",
      "desc": "Using c++ and OpenGl to make a game engine library for voxel based games. Voxels allow a player to have the freedom to manipulate and change their environment and have a more interactive experience.",
      "img": [
        "https://patina-dev.nyc3.cdn.digitaloceanspaces.com/personal/martin/projects/Voxel/VoxelLightTest.jfif",
        "https://patina-dev.nyc3.cdn.digitaloceanspaces.com/personal/martin/projects/Voxel/VoxelTerrainTest.jfif",
        "https://patina-dev.nyc3.cdn.digitaloceanspaces.com/personal/martin/projects/Voxel/VoxelPerfTest.jfif"
      ]
    },
    {
      "title": "2D Cloth Physics Simulation",
      "desc": "Created a physics module for my JavaScript game engine using algorithms such as Verlet Integration to calculate node/object positions in a soft-body simulation.",
      "img": [
        "https://patina-dev.nyc3.cdn.digitaloceanspaces.com/personal/martin/projects/ClothSim/Scene0.PNG",
        "https://patina-dev.nyc3.cdn.digitaloceanspaces.com/personal/martin/projects/ClothSim/Scene1.PNG",
        "https://patina-dev.nyc3.cdn.digitaloceanspaces.com/personal/martin/projects/ClothSim/Scene2.PNG"
      ]
    },
    {
      "title": "JS Game Engine API",
      "desc": "Using JavaScript and WebGL to create a basic game engine for web based games. Includes features such as async loading, instancing, scenes, bound/per-pixel collision, and more.",
      "img": [
        "https://patina-dev.nyc3.cdn.digitaloceanspaces.com/personal/martin/projects/JSGameEngine/dialogue0.PNG",
        "https://patina-dev.nyc3.cdn.digitaloceanspaces.com/personal/martin/projects/JSGameEngine/dialogue1.PNG",
        "https://patina-dev.nyc3.cdn.digitaloceanspaces.com/personal/martin/projects/JSGameEngine/dialogue-gif.gif"
      ]
    }
  ],
  "aboutData": [
    {
      "id": "life",
      "label": "Life Stuff",
      "desc": "My background",
      "content":
      "I am a Filipino/Japanese American born in Fresno, CA. I lived 8 years in Pewaukee, WI, then moved to Seattle, WA in late 2016. I began my interest in computers and programming in middle school when I joined a LEGO/VEX robotics team where I became the head programmer in my third year of joining."
    },
    {
      "id": "edu",
      "label": "Education",
      "desc": "My path as a growing software engineer",
      "content":
      "I graduated from the University of Washington-Bothell in the Fall of '24 with a BS of Science - CSSE. During my tenure at UW-Bothell, I had many opportunities to learn various interesting topics such as Game Engine and API development, CyberSecurity, User Centered Design, and more. I have also been an active member in both the Filipino American Student Association (FASA) and Brilliant Billiards Club (BBC) where I served as club president from 2021-23. I have also graduated from O'Dea High School in Seattle, WA."
    },
    {
      "id": "exp",
      "label": "Experience",
      "desc": "My work background",
      "content":
      "I have worked as a Team Manager at Grocery Outlet for three years where I learned multiple skills such as communication, customer service, leadership, and team coordination. I am currently an SWE intern at Patina Network learning professional project and full-stack development while also expanding my network, and preparing myself for job searching and technical interviews."
    },
    {
      "id": "hobby",
      "label": "Hobbies",
      "desc": "How I spend my free time",
      "content":
      "In my free time, I enjoy listening and making music. I listen to all genres of music and typically create cinematic future bass or house beats. I also participate in both casual and competitive sim racing in the  MX-5 cup or GT2/GT3 divisions."
    }
  ]
}
